[Killed] BlockStatement
main/components/HelpRequests/HelpRequestTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/help_requests/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/help_requests/edit/2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/help_requests/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/help_requests/edit/2' ]

Received: 

  1st spy call:

  [
-   "/help_requests/edit/2",

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:38:5
   };
 
   const columns = [
-    {
-      accessorKey: "id", // accessor is the "key" in the data
-    },
+    {},
 
     {
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:46:5
       header: "RequesterEmail",
       accessorKey: "requesterEmail",
     },
-    {
-      header: "TeamId",
-      accessorKey: "teamId",
-    },
+    {},
     {
       header: "TableOrBreakoutRoom",
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:47:15
       accessorKey: "requesterEmail",
     },
     {
-      header: "TeamId",
+      header: "",
       accessorKey: "teamId",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: TeamId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
