[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/help_requests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestCreatePage.jsx:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/help_requests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestCreatePage.jsx:10:13
 export default function HelpRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (helpRequest) => ({
     url: "/api/help_requests/post",
-    method: "POST",
+    method: "",
     params: {
       requesterEmail: helpRequest.requesterEmail,
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New helpRequest Created - id: ${helpRequest.id} requester email: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestCreatePage.jsx:40:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/help_requests" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ { to: '/help_requests' } ]

Number of calls: 0
