[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/help_requests?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/help_requests`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/help_requests`,
+      url: ``,
       params: {
         id,
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/help_requests`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/help_requests",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requesterEmail: zhangchi@ucsb.edu",

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:30:13
 
   const objectToAxiosPutParams = (helpRequest) => ({
     url: "/api/help_requests",
-    method: "PUT",
+    method: "",
     params: {
       id: helpRequest.id,
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "HelpRequest Updated - id: 17 requesterEmail: zhangchi@ucsb.edu",
