[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:57:24
           id="requesteremail"
           type="text"
           isInvalid={Boolean(errors.requesteremail)}
-          {...register("requesteremail", {
+          {...register("", {
             required: "Requester Email is required.",
             pattern: {
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:67:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requesteremail?.message}
+          {errors.requesteremail.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:78:24
           id="professoremail"
           type="text"
           isInvalid={Boolean(errors.professoremail)}
-          {...register("professoremail", {
+          {...register("", {
             required: "Professor Email is required.",
             pattern: {
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:88:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.professoremail?.message}
+          {errors.professoremail.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:126:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.daterequested && "Date Requested is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:126:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.daterequested && "Date Requested is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:136:38
           id="dateneeded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateneeded)}
-          {...register("dateneeded", {
-            required: true,
-            pattern: isodate_regex,
-          })}
+          {...register("dateneeded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:142:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateneeded && "Date Needed is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:142:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateneeded && "Date Needed is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
