[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:46:15
       accessorKey: "orgCode",
     },
     {
-      header: "Organization Translation Short",
+      header: "",
       accessorKey: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Translation Short. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:51:20
     },
     {
       header: "Organization Translation",
-      accessorKey: "orgTranslation",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgTranslation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:56:42
     {
       header: "Inactive",
       accessorKey: "inactive",
-      cell: (info) => (info.getValue() ? "true" : "false"),
+      cell: (info) => (info.getValue() ? "" : "false"),
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
