[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:134:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="solved">Solved</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-solved"}
+          data-testid={testIdPrefix + ""}
           id="solved"
           type="text"
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
