[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.jsx:67:22
             required: "Reviewer email is required.",
             maxLength: { value: 255, message: "Max length 255 characters" },
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,4}$/,
+              value: /^[\s@]+@[^\s@]+\.[a-zA-Z]{2,4}$/,
               message: "Must be a valid email address.",
             },
killedBy: MenuItemReviewForm tests displays error when invalid email format is entered
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Must be a valid email address.
</div> instead

[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.jsx:67:22
             required: "Reviewer email is required.",
             maxLength: { value: 255, message: "Max length 255 characters" },
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[a-zA-Z]{2,4}$/,
+              value: /^[^\s@]+@[\s@]+\.[a-zA-Z]{2,4}$/,
               message: "Must be a valid email address.",
             },
killedBy: MenuItemReviewForm tests displays error when invalid email format is entered
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Must be a valid email address.
</div> instead

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:85:33
           id="stars"
           type="number"
           isInvalid={Boolean(errors.stars)}
-          {...register("stars", {
-            required: "Stars is required.",
-            min: { value: 0, message: "Minimum is 0" },
-            max: { value: 5, message: "Maximum is 5" },
-          })}
+          {...register("stars", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:88:18
           {...register("stars", {
             required: "Stars is required.",
             min: { value: 0, message: "Minimum is 0" },
-            max: { value: 5, message: "Maximum is 5" },
+            max: {},
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Maximum is 5/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:107:23
           type="datetime-local" // Use datetime-local for better date input
           isInvalid={Boolean(errors.dateReviewed)}
           {...register("dateReviewed", {
-            required: "Date reviewed is required.",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Reviewed is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
