[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/MenuItemReview/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: MenuItemReviewIndexPage tests what happens when you click edit, admin
statusReason: expected "spy" to be called with arguments: [ '/MenuItemReview/edit/2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/MenuItemReview/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/MenuItemReview/edit/2' ]

Received: 

  1st spy call:

  [
-   "/MenuItemReview/edit/2",

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:51:5
       header: "reviewerEmail",
       accessorKey: "reviewerEmail",
     },
-    {
-      header: "stars",
-      accessorKey: "stars",
-    },
+    {},
     {
       header: "dateReviewed",
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:55:5
       header: "stars",
       accessorKey: "stars",
     },
-    {
-      header: "dateReviewed",
-      accessorKey: "dateReviewed",
-    },
+    {},
     {
       header: "comments",
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:56:15
       accessorKey: "stars",
     },
     {
-      header: "dateReviewed",
+      header: "",
       accessorKey: "dateReviewed",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: dateReviewed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:59:5
       header: "dateReviewed",
       accessorKey: "dateReviewed",
     },
-    {
-      header: "comments",
-      accessorKey: "comments",
-    },
+    {},
   ];
 
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
