[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:22:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid="UCSBDiningCommonsMenuItemForm-id"
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Unable to find an element by: [data-testid="/UCSBDiningCommonsMenuItemForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
