[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:19:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsbdiningcommonsmenuitem/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/ucsbdiningcommonsmenuitem/edit/1' ]

Received: 

  1st spy call:

  [
-   "/ucsbdiningcommonsmenuitem/edit/1",
