[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:33:24
           isInvalid={Boolean(errors.orgCode)}
           {...register("orgCode", {
             required: "Organization Code is required.",
-            maxLength: {
-              value: 31,
-              message: "Max length 31 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 31 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:75:42
           id="orgTranslation"
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
-          {...register("orgTranslation", {
-            required: "Organization Translation is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("orgTranslation", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:76:23
           type="text"
           isInvalid={Boolean(errors.orgTranslation)}
           {...register("orgTranslation", {
-            required: "Organization Translation is required.",
+            required: "",
             maxLength: {
               value: 255,
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:77:24
           isInvalid={Boolean(errors.orgTranslation)}
           {...register("orgTranslation", {
             required: "Organization Translation is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:94:36
           data-testid={testIdPrefix + "-inactive"}
           id="inactive"
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive", {
-            required: "Inactive status is required",
-          })}
+          {...register("inactive", {})}
         >
           <option value="">Select...</option>
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Inactive status is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:99:26
           })}
         >
           <option value="">Select...</option>
-          <option value={false}>false</option>
+          <option value={true}>false</option>
           <option value={true}>true</option>
         </Form.Select>
killedBy: UCSBOrganizationForm tests inactive field is rendered correctly
statusReason: expected '' to be 'false' // Object.is equality

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:100:26
         >
           <option value="">Select...</option>
           <option value={false}>false</option>
-          <option value={true}>true</option>
+          <option value={false}>true</option>
         </Form.Select>
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests inactive field is rendered correctly
statusReason: expected '' to be 'true' // Object.is equality
