[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:19:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsborganization/edit/${cell.row.original.orgCode}`);
+    navigate(``);
   };
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/ucsborganization/edit/GG' ]

Received: 

  1st spy call:

  [
-   "/ucsborganization/edit/GG",

[Killed] ArrayDeclaration
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:38:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "Organization Code",
-      accessorKey: "orgCode",
-    },
-    {
-      header: "Organization Translation Short",
-      accessorKey: "orgTranslationShort",
-    },
-    {
-      header: "Organization Translation",
-      accessorKey: "orgTranslation",
-    },
-    {
-      header: "Inactive",
-      accessorKey: "inactive",
-      cell: (info) => (info.getValue() ? "true" : "false"),
-    },
-  ];
+  const columns = [];
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:47:5
       header: "Organization Translation Short",
       accessorKey: "orgTranslationShort",
     },
-    {
-      header: "Organization Translation",
-      accessorKey: "orgTranslation",
-    },
+    {},
     {
       header: "Inactive",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:54:13
     {
       header: "Inactive",
       accessorKey: "inactive",
-      cell: (info) => (info.getValue() ? "true" : "false"),
+      cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:57:43
       cell: (info) => (info.getValue() ? "true" : "false"),
     },
   ];
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
   return (
     <OurTable
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
