[Killed] ConditionalExpression
main/pages/HelpRequests/HelpRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...helpRequest,
-              solved: helpRequest.solved === true ? "true" : "false",
-            }}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Shows solved=false when backend returns false
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/HelpRequests/HelpRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit HelpRequest</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...helpRequest,
-              solved: helpRequest.solved === true ? "true" : "false",
-            }}
-          />
-        )}
+        {helpRequest || <HelpRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={{
+  ...helpRequest,
+  solved: helpRequest.solved === true ? "true" : "false"
+}} />}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Cannot read properties of undefined (reading 'solved')

[Killed] EqualityOperator
main/pages/HelpRequests/HelpRequestEditPage.jsx:77:23
             buttonLabel={"Update"}
             initialContents={{
               ...helpRequest,
-              solved: helpRequest.solved === true ? "true" : "false",
+              solved: helpRequest.solved !== true ? "true" : "false",
             }}
           />
killedBy: HelpRequestEditPage tests tests where backend is working normally Shows solved=false when backend returns false
statusReason: expect(element).toHaveValue(false)

Expected the element to have value:
  false
Received:
  true

[Killed] BooleanLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:77:46
             buttonLabel={"Update"}
             initialContents={{
               ...helpRequest,
-              solved: helpRequest.solved === true ? "true" : "false",
+              solved: helpRequest.solved === false ? "true" : "false",
             }}
           />
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(true)

Expected the element to have value:
  true
Received:
  false
