[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (MenuItemReview) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: MenuItemReview.itemId,
-      reviewerEmail: MenuItemReview.reviewerEmail,
-      stars: MenuItemReview.stars,
-      comments: MenuItemReview.comments,
-      dateReviewed: MenuItemReview.dateReviewed,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (MenuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /MenuItemReview
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:9:10
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
   const objectToAxiosParams = (MenuItemReview) => ({
-    url: "/api/menuitemreviews/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /MenuItemReview
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New review Created - itemId: 1 reviewerEmail: string@gmail.com stars: 4 comments: string dateReviewed: 2025-12-31T12:34",

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:39:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/MenuItemReview" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /MenuItemReview
statusReason: expected "spy" to be called with arguments: [ { to: '/MenuItemReview' } ]

Number of calls: 0
