[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `Recommendation Request Updated - id: ${recommendationRequest.id} Requester email: ${recommendationRequest.requesteremail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided and changes when data is changed
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
