[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsborganization?orgCode=${orgCode}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsborganization`,
-      params: {
-        orgCode,
-      },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {organization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...organization,
-              inactive: organization.inactive === true ? "true" : "false",
-            }}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {organization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...organization,
-              inactive: organization.inactive === true ? "true" : "false",
-            }}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:73:30
           <UCSBOrganizationForm
             submitAction={onSubmit}
             buttonLabel={"Update"}
-            initialContents={{
-              ...organization,
-              inactive: organization.inactive === true ? "true" : "false",
-            }}
+            initialContents={{}}
           />
         )}
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(AS)

Expected the element to have value:
  AS
Received:

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:75:25
             buttonLabel={"Update"}
             initialContents={{
               ...organization,
-              inactive: organization.inactive === true ? "true" : "false",
+              inactive: false ? "true" : "false",
             }}
           />
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Shows inactive=true when backend returns true
statusReason: expect(element).toHaveValue(true)

Expected the element to have value:
  true
Received:
  false

[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:75:51
             buttonLabel={"Update"}
             initialContents={{
               ...organization,
-              inactive: organization.inactive === true ? "true" : "false",
+              inactive: organization.inactive === false ? "true" : "false",
             }}
           />
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expect(element).toHaveValue(false)

Expected the element to have value:
  false
Received:
  true
